{
  "backend/main.mo": "Motoko canister defining user profiles, goals, planning data structures, and goal-related CRUD operations with access control.",
  "feature_evidence.json": "Metadata describing a feature fix, its related frontend file, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Pre-written summaries of various frontend files covering components, hooks, pages, and styling.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme color tokens and globals.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup flow, goal library modal logic, layout, and theme/toast providers.",
  "frontend/src/components/AutoPlanner/AutoPlannerGoalPicker.tsx": "UI for entering or selecting a goal template and duration, generating an auto-planned goal.",
  "frontend/src/components/AutoPlanner/AutoPlannerReview.tsx": "Review screen for editing and saving generated plans, orchestrating goal creation, tasks, milestones, and lock-in steps.",
  "frontend/src/components/AutoPlanner/AutoPlannerView.tsx": "Controls the Auto Planner flow between goal input and plan review, storing and passing the generated plan to child components.",
  "frontend/src/components/DailyCheckIn.tsx": "Fetches daily tasks and lets users mark them completed or missed with reasons, submitting a daily check‑in record.",
  "frontend/src/components/DashboardHome.tsx": "Displays the main dashboard landing section with user greeting, locked‑in goals, and navigation to key app sections.",
  "frontend/src/components/Footer.tsx": "Renders the app footer with credits, external link, and version information.",
  "frontend/src/components/GoalDefinitionFlow.tsx": "Guides users through defining a new goal with description, timeframe, and motivation, then submits it to the backend.",
  "frontend/src/components/GoalDetail.tsx": "Shows detailed goal info with tabs for planning, daily tasks, weekly review, and allows goal deletion.",
  "frontend/src/components/GoalLibraryModal.tsx": "Displays a modal listing goal templates by category, allowing users to select and create goals from templates.",
  "frontend/src/components/GoalsOverview.tsx": "Displays the user's goals, allows creating new goals or selecting from a library, and shows goal cards with status and timeframe.",
  "frontend/src/components/Header.tsx": "Renders the app header with login handling, theme toggling, accent selection, and profile menu for authenticated users.",
  "frontend/src/components/lockedIn/CheckInTicker.tsx": "Shows a 7‑day check‑in streak visualization with completion stats for a goal.",
  "frontend/src/components/lockedIn/LockedInGoalsSection.tsx": "Lists locked‑in goals with check‑in controls and navigation to the Auto Planner when empty.",
  "frontend/src/components/PlanningPhase.tsx": "Guides users through adding milestones and tasks for a goal, then locking in the plan, with step-by-step input flows.",
  "frontend/src/components/profile/emojiOptions.ts": "Exports a list of emoji options for profile customization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal for creating or editing a user profile, including name and avatar emoji selection.",
  "frontend/src/components/SettingsPanel.tsx": "Offers profile editing, account management, and sign-out options, including avatar changes and principal copying.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanDashboard.tsx": "Shows weekly planning status for locked-in goals and offers navigation to the auto-planner when no plans exist.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanGoalCard.tsx": "Displays a goal card with metrics, milestones, tasks, and expandable detail view using data from multiple queries.",
  "frontend/src/components/WeeklyReview.tsx": "Provides a weekly review form where users mark completed tasks, write a summary, and submit a review.",
  "frontend/src/contexts/DashboardNavigationContext.tsx": "Provides context for tracking and updating the active dashboard section.",
  "frontend/src/hooks/useAccentPreset.ts": "Manages theme accent presets and updates CSS variables based on user selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for loading and mutating user profiles, goals, and goal-related data via the actor API with toast notifications.",
  "frontend/src/index.css": "Tailwind base styles and a comprehensive set of CSS variables defining theming, color tokens, and utilities for light and dark modes.",
  "frontend/src/lib/autoPlanner/generatePlan.ts": "Generates a structured goal plan with milestones, weekly tasks, and daily tasks based on timeframe and optional custom duration.",
  "frontend/src/lib/goalTemplates.ts": "Defines predefined goal templates containing description, timeframe, milestones, and tasks for various goal categories.",
  "frontend/src/main.tsx": "Application entry point that sets up React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard UI handling navigation between sections, sidebar/menu logic, and displaying goal and planning components.",
  "frontend/src/pages/HomePage.tsx": "Public landing page with branding, hero content, features, and login trigger using Internet Identity.",
  "frontend/src/utils/dates.ts": "Utilities converting backend nanosecond timestamps to Date and formatting them for display, including relative dates.",
  "frontend/src/utils/errors.ts": "Extracts readable messages from unknown error values with fallbacks for various error shapes.",
  "frontend/src/utils/trackingMetrics.ts": "Computes check‑in and goal metrics over recent days, including completion rates and counts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current state, issues, and feature requests for fixing the Auto Planner flow."
}