{
  "backend/main.mo": "Motoko canister implementing user access control, profiles, goals, planning data structures, and CRUD-style methods for goals and reviews.",
  "feature_evidence.json": "Feature evidence report listing two UI refactor features with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries for many frontend components and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH variables for light and dark themes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, goal library modal flow, theming, and dashboard routing.",
  "frontend/src/components/AutoPlanner/AutoPlannerGoalPicker.tsx": "UI component letting users enter or select a template goal and duration to generate an auto‑planned goal using generatePlan.",
  "frontend/src/components/AutoPlanner/AutoPlannerReview.tsx": "Provides a review and editing interface for an auto‑generated plan and handles saving goals, milestones, and tasks to the backend.",
  "frontend/src/components/AutoPlanner/AutoPlannerView.tsx": "Manages the Auto Planner flow between goal input and plan review, rendering the appropriate step.",
  "frontend/src/components/DailyCheckIn.tsx": "Displays daily tasks, tracks completion or missed reasons, and submits a daily check‑in for a goal.",
  "frontend/src/components/DashboardHome.tsx": "Renders the main dashboard hero, navigation sections, and locked‑in goals overview.",
  "frontend/src/components/Footer.tsx": "Simple footer showing credits, external link, and app version.",
  "frontend/src/components/GoalDefinitionFlow.tsx": "Guides users through defining a new goal with description, timeframe, and motivation before saving.",
  "frontend/src/components/GoalDetail.tsx": "Shows detailed goal info with tabs for planning, tasks, reviews, and includes deletion functionality.",
  "frontend/src/components/GoalLibraryModal.tsx": "Displays a modal with categorized goal templates, lets users select templates, and creates goals from them.",
  "frontend/src/components/GoalsOverview.tsx": "Shows a list of user goals with creation options and navigation to goal details or the goal library.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, accent color selector, profile menu, and navigation logic.",
  "frontend/src/components/lockedIn/CheckInTicker.tsx": "Shows a 7‑day visual check‑in streak with completion indicators and exposes overall check‑in stats.",
  "frontend/src/components/lockedIn/LockedInGoalsSection.tsx": "Lists all locked‑in goals with check‑in controls and links to create new plans when none exist.",
  "frontend/src/components/PlanningPhase.tsx": "Guides users through adding milestones and tasks for a goal and allows locking in the completed plan.",
  "frontend/src/components/profile/emojiOptions.ts": "Exports a preset list of emoji options for profile customization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or editing a user profile with name and emoji avatar selection.",
  "frontend/src/components/SettingsPanel.tsx": "Settings panel for updating profile info, managing account actions, and copying principal ID.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanDashboard.tsx": "Displays the user's locked-in weekly goals, showing placeholders if none exist and allowing navigation to the Auto Planner.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanGoalCard.tsx": "Renders an expandable card for a specific goal showing milestones, tasks, and progress metrics.",
  "frontend/src/components/WeeklyReview.tsx": "Provides a weekly review form where users mark completed tasks, write a summary, and submit a review.",
  "frontend/src/contexts/DashboardNavigationContext.tsx": "Provides context for tracking and updating the active dashboard section.",
  "frontend/src/hooks/useAccentPreset.ts": "Manages accent color presets, syncing them to localStorage and updating CSS variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including loading, login, logout, and status handling. Wraps AuthClient creation and exposes identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, goals, and related goal data through an actor interface. Handles caching, invalidation, errors, and toast notifications.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for theming, including light/dark modes, semantic colors, and utility classes. Includes shared background utilities.",
  "frontend/src/lib/autoPlanner/generatePlan.ts": "Generates a structured goal plan with calculated milestones, weekly tasks, and daily tasks based on timeframe and optional custom duration. Provides default duration logic per timeframe.",
  "frontend/src/lib/goalTemplates.ts": "Defines predefined goal templates across categories with milestones, tasks, motivations, and default timeframes. Used to quickly create structured goal setups.",
  "frontend/src/main.tsx": "Bootstraps the React app, adding QueryClientProvider and InternetIdentityProvider before rendering App. Imports global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with navigation, sidebar, and section switching for goals, tasks, analytics, and auto-planning. Manages selected goal state and integrates various dashboard components.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with a hero section, feature highlights, and a login button using Internet Identity.",
  "frontend/src/utils/dates.ts": "Provides helper functions to convert backend nanosecond timestamps into JavaScript dates and formatted date strings.",
  "frontend/src/utils/errors.ts": "Extracts readable error messages from unknown error objects with fallbacks.",
  "frontend/src/utils/trackingMetrics.ts": "Computes check-in and goal metrics over recent days, including completion rates and counts.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session-based parameters for routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and extensions for the frontend.",
  "project_state.json": "Stores project metadata, feature definitions, pending requests, and state versioning."
}