{
  "backend/main.mo": "Motoko canister defining user profiles, goals, tasks, reviews, and access-controlled CRUD operations with internal maps for per‑user data.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base and CSS variable definitions for light/dark themes and semantic color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup flow, goal library modal, routing, and theming.",
  "frontend/src/components/AutoPlanner/AutoPlannerGoalPicker.tsx": "UI for entering or selecting a goal template and triggering auto‑plan generation.",
  "frontend/src/components/AutoPlanner/AutoPlannerReview.tsx": "Review/edit screen for generated plans with mutations to save goals, tasks, milestones, and lock them in.",
  "frontend/src/components/AutoPlanner/AutoPlannerView.tsx": "Handles the Auto Planner flow, switching between goal input and reviewing a generated plan.",
  "frontend/src/components/DailyCheckIn.tsx": "Displays daily tasks for a goal, lets users mark completion or reasons for missing, and submits the check-in.",
  "frontend/src/components/DashboardHome.tsx": "Renders the dashboard home with a welcome header and navigation cards for key app sections.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/GoalDefinitionFlow.tsx": "Multi-step form for creating a goal, collecting description, timeframe, and motivation.",
  "frontend/src/components/GoalDetail.tsx": "Shows detailed goal info with tabs for planning, daily tasks, weekly tasks, and overview, depending on lock status.",
  "frontend/src/components/GoalLibraryModal.tsx": "Modal that lists predefined goal templates, allowing users to select and create goals from them.",
  "frontend/src/components/GoalsOverview.tsx": "Displays a user's goals, allows creating new goals or selecting from a goal library, and shows goal cards with loading and empty states.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme switching, accent color selection, login handling, and user profile dropdown actions.",
  "frontend/src/components/lockedIn/CheckInTicker.tsx": "Renders a 7‑day check‑in streak ticker with completion indicators based on daily check‑in stats.",
  "frontend/src/components/lockedIn/LockedInGoalsSection.tsx": "Shows all locked‑in goals with check‑in stats and offers navigation to the Auto Planner when none exist.",
  "frontend/src/components/PlanningPhase.tsx": "Guides users through creating milestones and tasks for a goal and finalizing the plan with a lock-in step.",
  "frontend/src/components/profile/emojiOptions.ts": "Exports a list of emoji options for user profile customization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or editing a user profile with name and emoji avatar selection, saving changes via mutation.",
  "frontend/src/components/SettingsPanel.tsx": "Provides profile editing, avatar selection, principal copying, and sign‑out controls within a settings view.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanDashboard.tsx": "Shows weekly planning status, prompting users to create an auto plan or listing locked‑in goal plans.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanGoalCard.tsx": "Displays a goal card with metrics, milestones, and weekly/daily tasks, expandable to show detailed progress data.",
  "frontend/src/components/WeeklyReview.tsx": "Provides a weekly review UI where users mark weekly tasks complete and submit progress summaries.",
  "frontend/src/contexts/DashboardNavigationContext.tsx": "Provides context for tracking and updating the active dashboard section.",
  "frontend/src/hooks/useAccentPreset.ts": "Manages selectable UI accent color presets and syncs them to CSS variables and local storage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication via Internet Identity, managing identity state, login flow, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and mutating user profiles, goals, and goal-related data via an actor API with toast feedback.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light and dark themes along with utility classes and background styles.",
  "frontend/src/lib/autoPlanner/generatePlan.ts": "Generates a structured plan with milestones and tasks based on a goal description and timeframe.",
  "frontend/src/lib/goalTemplates.ts": "Provides predefined goal templates with milestones and tasks for various categories like study, fitness, and productivity.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Implements the dashboard layout with navigation, side menu, and dynamic section rendering based on user selection.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero content, features, and login handling via Internet Identity.",
  "frontend/src/utils/dates.ts": "Provides helpers to convert nanosecond bigint timestamps to Dates and format them as date, datetime, or relative strings.",
  "frontend/src/utils/trackingMetrics.ts": "Computes 7‑day check‑in stats and aggregates goal metrics from daily check‑ins and weekly reviews.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking schema version, issues, and a pending UI fix request for button styling consistency."
}