{
  "backend/main.mo": "Defines user profiles, goals, tasks, reviews, and access-controlled CRUD logic for a goal‑tracking canister.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to source files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend component’s purpose and behavior.",
  "frontend/index.css": "Tailwind base styles with CSS variables for light/dark themes and semantic color tokens.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, goal library modal flow, routing, and theme provider.",
  "frontend/src/components/AutoPlanner/AutoPlannerGoalPicker.tsx": "UI for selecting or entering a goal, choosing duration, and generating an automated plan using templates or free text.",
  "frontend/src/components/AutoPlanner/AutoPlannerReview.tsx": "Displays and edits an auto‑generated plan, then saves goals, milestones, and tasks through API mutations and locks in the goal.",
  "frontend/src/components/AutoPlanner/AutoPlannerView.tsx": "Manages the Auto Planner flow, switching between goal input and plan review components.",
  "frontend/src/components/DailyCheckIn.tsx": "Shows daily tasks, lets users mark tasks completed or missed with reasons, and submits a daily check‑in.",
  "frontend/src/components/DashboardHome.tsx": "Provides the main dashboard landing page with navigation and a hero section, including quick access to major app sections.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/GoalDefinitionFlow.tsx": "Guides users through defining a goal, selecting a timeframe, adding motivation, and creating the goal via API.",
  "frontend/src/components/GoalDetail.tsx": "Displays detailed goal info with tabs for planning, daily check‑ins, weekly reviews, and allows deleting the goal.",
  "frontend/src/components/GoalLibraryModal.tsx": "Modal listing predefined goal templates by category, allowing multi-select and creation of goals from templates.",
  "frontend/src/components/GoalsOverview.tsx": "Displays user's goals with create and library options, handling loading, empty state, and goal selection.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login, theme toggling, accent presets, profile actions, and navigation.",
  "frontend/src/components/lockedIn/CheckInTicker.tsx": "Renders a 7‑day visual check‑in tracker for a goal with completion stats.",
  "frontend/src/components/lockedIn/LockedInGoalsSection.tsx": "Lists locked‑in goals with check‑in summaries or prompts creation of a new auto plan.",
  "frontend/src/components/PlanningPhase.tsx": "Guided flow for adding milestones and tasks to a goal, with locking support and conditional review display.",
  "frontend/src/components/profile/emojiOptions.ts": "Exports a predefined list of emoji options for profile customization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or editing a user profile, including name and emoji avatar selection.",
  "frontend/src/components/SettingsPanel.tsx": "Settings page enabling profile updates, avatar changes, principal copying, and sign‑out actions.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanDashboard.tsx": "Displays weekly goals overview, showing locked-in goals or prompting the user to create an auto plan.",
  "frontend/src/components/WeeklyPlan/WeeklyPlanGoalCard.tsx": "Expandable card showing a goal’s metrics, milestones, and weekly tasks with data fetched per goal.",
  "frontend/src/components/WeeklyReview.tsx": "Weekly review form allowing users to mark tasks completed and submit progress summaries.",
  "frontend/src/contexts/DashboardNavigationContext.tsx": "Provides context for tracking and updating the active dashboard section.",
  "frontend/src/hooks/useAccentPreset.ts": "Manages selectable accent color presets and applies them to CSS variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login, logout, and identity state. Wraps AuthClient creation and exposes status flags through a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, goals, and related backend data. Uses an actor instance to call backend canister methods with automatic cache updates and toasts.",
  "frontend/src/index.css": "Sets up Tailwind base styles, custom CSS variables for light and dark themes, and utility classes including a shared background texture. Applies global styling for the app’s design system.",
  "frontend/src/lib/autoPlanner/generatePlan.ts": "Generates a structured goal plan with milestones, weekly tasks, and daily tasks based on timeframe or custom duration. Returns a complete auto‑generated plan object used by the Auto Planner.",
  "frontend/src/lib/goalTemplates.ts": "Defines predefined goal templates with milestones and tasks across categories like study, fitness, and productivity. Used for creating goals from ready‑made structures.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing React Query and Internet Identity providers before rendering the root App component. Imports global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard layout, navigation menu, and section switching for goals, tasks, analytics, and the auto planner. Manages selected goal state and renders section‑specific components.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero content, feature highlights, and a login button using Internet Identity.",
  "frontend/src/utils/dates.ts": "Provides helpers to convert backend nanosecond timestamps to Date objects and format them for display.",
  "frontend/src/utils/trackingMetrics.ts": "Computes goal and check‑in statistics from daily check‑ins and weekly reviews, including completion rates and recent activity.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and content paths.",
  "project_state.json": "Project metadata describing features, issues, and new requests related to fixing and improving the Welcome popup and header logo behavior."
}